Autodesk.Revit.DB.LinkLoadContent.GetLinkLoadResult
Retrieves the LinkLoadResult of the attempt to load or reload a Revit link.
Remarks:
A LinkLoadResult object is included in the LinkLoadContent class so that
IExternalResourceUIServers will have additional information about the status of the
link to display to the user.
The LinkLoadResult is added to the LinkLoadContent object during the load operation,
after the IExternalResourceServer LoadResource method has been called.
Consequently, this method will return NULL if called from the LoadResource method
of an IExternalResourceServer.
Returns:
A LinkLoadObject containing the status and other information about an attempt by Revit
to load a Revit link.
Since:
2015

Autodesk.Revit.DB.LinkLoadContent.SetLinkDataPath(Autodesk.Revit.DB.ModelPath)
Sets the Link data path owned by this LinkLoadContent object.
Remarks:
This path must be a location accessible to Revit. Revit will
attempt to load the link from this location.
linkPath:
The Links data path set for this LinkLoadContent object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.LinkLoadContent.GetLinkDataPath
Returns the Link data path owned by this LinkLoadContent object.
Remarks:
This path represents the physical location of the
link. Revit will attempt to load the link from this
location.
Returns:
The Links data path owned by this LinkLoadContent object.
Since:
2015

Autodesk.Revit.DB.LinkLoadContent
This class is used by IExternalResourceServers to return Link data to Revit when their
LoadResource method is invoked.  It also contains additional information used by
IExternalResourceUIServers to display link load status results to the user.
Remarks:
This class handles Revit links.
Revit links must be loaded from a path accessible to Revit.
Server implementors should provide Revit with a ModelPath representing
a location from which to load the link. Revit will handle the actual
file loading.
Servers which represent non-local file locations will need to
create their own implementation for copying
or moving files to a Revit-accessible location.
The link data path used for link loading may be different from
the path displayed to the
user. The link data path represents the literal location of the
file, whereas the link's display path represents what the user sees
as the name of the link. See Autodesk::Revit::DB::ExternalResourceReference::InSessionPath
for more details on display paths.
Since:
2015